source/_static/diagrams/21-writing-one-from-nothing.d2
direction: right
n0: "sources"
n1: "easyblock"
n2: "sanity"
n3: ".eb"
n0 -> n1
n1 -> n2
n2 -> n3
